Autodesk.Revit.UI.RevitCommandId.GetInternalCommandName
Returns:
The name of the command we set internally.
Since:
2013

Autodesk.Revit.UI.RevitCommandId.LookupCommandId(System.String)
Looks up and retrieves the Revit command id with the given id string.
name:
he Revit command name. Refer to the entries in the Revit journal to find the string to use for a particular command.
Returns:
The Revit command id. Returning "null" if a command with the given name was not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.UI.RevitCommandId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.RevitCommandId.HasBinding
Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Remarks:
This will not indicate if one or more applications have subscribed to the BeforeExecuted event,
as this event is not limited to a single subscriber.
Since:
2013

Autodesk.Revit.UI.RevitCommandId.CanHaveBinding
Indicates whether the command can be assigned a binding to an external add-in.
Since:
2013

Autodesk.Revit.UI.RevitCommandId.Id
The command id.
Since:
2013

Autodesk.Revit.UI.RevitCommandId.Name
The command name.
Since:
2013

Autodesk.Revit.UI.RevitCommandId.LookupPostableCommandId(Autodesk.Revit.UI.PostableCommand)
Looks up and retrieves the Revit command id with the given id string.
postableCommand: The postable command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when name is null.
Returns:  The Revit command id. Returning null if a command with the given name was not found.
Since: 2014

Autodesk.Revit.UI.RevitCommandId.#ctor(System.String,System.UInt32)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.UI.RevitCommandId
Represents a command id in Autodesk Revit.
Remarks:
Each Revit command is assigned a command id and non-localized name.
This class allows you to look up a command by its name, and represents any Revit command in the use of an AddInCommandBinding.
Since:
2013